In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("carRecords.csv",index_col=0)

In [5]:
df.head()

   type  year                 title      trim     price  mileage
0  used  2017       Hyundai Accent        SE    13879.0      168
1  used  2015      Chevrolet Sonic       LTZ     8990.0    49000
2  used  2001   Mitsubishi Montero   Limited     7995.0   130752
3  used  2012             Scion xB      Base    11995.0    51947
4  used  2007  Rolls-Royce Phantom      Base   139999.0    14796

In [6]:
df['make'], df['model'] = df['title'].str.split(' ', 1).str

In [9]:
df.head()

,type,year,title,trim,price,mileage,make,model
0,used,2017,Hyundai Accent,SE,13879.0,168,Hyundai,Accent
1,used,2015,Chevrolet Sonic,LTZ,8990.0,49000,Chevrolet,Sonic
2,used,2001,Mitsubishi Montero,Limited,7995.0,130752,Mitsubishi,Montero
3,used,2012,Scion xB,Base,11995.0,51947,Scion,xB
4,used,2007,Rolls-Royce Phantom,Base,139999.0,14796,Rolls-Royce,Phantom

In [11]:
df = df.drop(['title'], axis=1)
df.head()

   type  year      trim     price  mileage         make     model
0  used  2017       SE    13879.0      168      Hyundai   Accent
1  used  2015      LTZ     8990.0    49000    Chevrolet    Sonic
2  used  2001  Limited     7995.0   130752   Mitsubishi  Montero
3  used  2012     Base    11995.0    51947        Scion       xB
4  used  2007     Base   139999.0    14796  Rolls-Royce  Phantom

In [17]:
df['model'].nunique()

488

In [18]:
df['year'].nunique()

28

In [19]:
df['price'].min()

1875.0

In [20]:
df['price'].max()

389999.0

In [24]:
df['price'].mean()

31655.446403448786

In [21]:
df['mileage'].min()

0

In [22]:
df['mileage'].max()

343848

In [25]:
df['mileage'].mean()

4911.805262375502

In [38]:
bin_price=[0,5000,10000,20000,30000,40000,50000,70000,100000,320000]
bin_label_price=["<5k","5k-10k","10k-20k","20k-30k","30k-40k","40k-50k","50k-70k","70k-100k",">100k"]

In [39]:
df['price_bin']=pd.cut(df['price'],bins=bin_price,labels=bin_label_price)

In [40]:
df.head()

   type  year      trim     price  mileage         make     model price_bin
0  used  2017       SE    13879.0      168      Hyundai   Accent    10k-20k
1  used  2015      LTZ     8990.0    49000    Chevrolet    Sonic     5k-10k
2  used  2001  Limited     7995.0   130752   Mitsubishi  Montero     5k-10k
3  used  2012     Base    11995.0    51947        Scion       xB    10k-20k
4  used  2007     Base   139999.0    14796  Rolls-Royce  Phantom      >100k

In [41]:
pd.value_counts(df["price_bin"], sort=False)

<5k           113
5k-10k        536
10k-20k      3205
20k-30k     14957
30k-40k      8441
40k-50k      4037
50k-70k      1816
70k-100k      372
>100k         155
Name: price_bin, dtype: int64

In [50]:
bin_mileage = [0,15000,30000,45000,60000,75000,90000, 350000]
bin_label_mileage = ["<5k","15k-30k","30k-45k","45k-60k","60k-75k","75k-90k",">90k"]

In [51]:
df['mileage_bin']=pd.cut(df['mileage'],bins=bin_mileage,labels=bin_label_mileage,include_lowest=True)

In [52]:
df.head()

,type,year,trim,price,mileage,make,model,price_bin,mileage_bin
0,used,2017,SE,13879.0,168,Hyundai,Accent,10k-20k,<5k
1,used,2015,LTZ,8990.0,49000,Chevrolet,Sonic,5k-10k,45k-60k
2,used,2001,Limited,7995.0,130752,Mitsubishi,Montero,5k-10k,>90k
3,used,2012,Base,11995.0,51947,Scion,xB,10k-20k,45k-60k
4,used,2007,Base,139999.0,14796,Rolls-Royce,Phantom,>100k,<5k

In [53]:
pd.value_counts(df["mileage_bin"], sort=False)

<5k        31001
15k-30k      507
30k-45k      685
45k-60k      359
60k-75k      292
75k-90k      245
>90k         546
Name: mileage_bin, dtype: int64

In [54]:
df.to_csv("carRecordsCleaned.csv")